Tekla Open API Reference for Tekla Structures 2025
View.ViewAttributes.LabelPositionVertical Property
 The vertical position of the view label.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public View.VerticalLabelPosition LabelPositionVertical { get; set; }
Public Property LabelPositionVertical As View.VerticalLabelPosition
	Get
	Set
Property Value
Type: View.VerticalLabelPosition
See Also
Reference
View.ViewAttributes Class
Tekla.Structures.Drawing Namespace